import random #імпортуємо модуль random для генерації випадкових чисел
import matplotlib.pyplot as plt  # Бібліотека для побудови графіків

random.seed(1)  # встановлюємо початкове значення генератора випадкових чисел для відтворюваності результатів

n_values = [10, 100, 1000, 10000, 100000, 1000000] # кількість випробувань для перевірки закону великих чисел
p = 0.5 # теоретична ймовірність випадання події

# Списки для збереження результатів
frequencies = []  # список для збереження відносних частот
errors = []  # список для збереження абсолютних похибок

for N in n_values:
    M = 0

    for _ in range(N):
        r = random.random()  # генеруємо випадкове число від 0 до 1
        if r < p: # перевіряємо, чи випадкове число менше теоретичної ймовірності p
            M += 1  # якщо випадкове число менше p, збільшуємо лічильник успішних випадків
    W = M / N  # обчислюємо відносну частоту випадання події
    delta = abs(W - p)  # обчислення абсолютної похибки

    print("Кількість випробувань: ", N)
    print("Кількість успішних випадків: ", M)
    print("Відносна частота настання події: ",f"{W:.6f}")
    print("Абсолютна похибка: ", f"{delta:.6f}")
    print()
            
    # Зберігаємо результати
    frequencies.append(W)
    errors.append(delta)

# Побудова графіків
plt.plot(n_values, frequencies, marker='o', label="Статистикна частота W(А)")

# Теоретична ймовірність p
plt.axhline(y=p, color='r', linestyle='--', label="Теоретична ймовірність P(A)")
plt.xscale('log')  # Використовуємо логарифмічну шкалу для осі x

#Оформлення графіка
plt.xlabel("Кількість випробувань (N)")
plt.ylabel("Відносна частота W(А)")
plt.title("Закон великих чисел")
plt.legend()
plt.grid(True)

# збереження графіка у файл
plt.savefig("graphics/simulation_results.png")

plt.show()  # Відображення графіка